# CreateShell

## Description
Creates a shelled solid from a NURBS surface.

```pascal
FUNCTION CreateShell(
				surface   : HANDLE;
				thickness : REAL) : Handle;
```

```python

def vs.CreateShell(surface, thickness):
    return Handle
```

## Parameters
|Name|Type|Description|
|---|---|---|
|surface|HANDLE||
|thickness|REAL||

## Version
Availability: from Vectorworks 2016
## Category
* Objects - Solids